Тест_ЗУП_31_КОРП/src/Documents/ВключениеВКадровыйРезерв/ВключениеВКадровыйРезерв.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВключениеВКадровыйРезерв</name>
  <registerRecords>InformationRegister.ИсторияКадровогоРезерва</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРезерва</name>
    <type>
      <types>CatalogRef.ВидыКадровогоРезерва</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставДокумента</name>
    <comment>Краткий перечень сотрудников, включенных в документ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПозицияРезерва</name>
      <type>
        <types>CatalogRef.КадровыйРезерв</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияСКадровымиРезервистами</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/СостоянияСогласования/СостоянияСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСогласования</name>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ВключениеВКадровыйРезерв/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	ДанныеДляПроведения = Документы.ВключениеВКадровыйРезерв.ПолучитьДанныеДляПроведения(Ссылка);
	КадровыйРезерв.СформироватьДвиженияИсторииКадровогоРезерва(Движения, ДанныеДляПроведения, "ДвиженияИсторииКадровогоРезерва");
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаРассмотрения, "Объект.ДатаРассмотрения", Отказ,
		НСтр("ru='Дата рассмотрения'"));
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйРезервПоВидам") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВидРезерва");
	КонецЕсли;
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты,МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаРассмотрения = НачалоДня(ДатаРассмотрения) + КадровыйРезерв.ЗначениеВремениПоСтатусуРезерва(ПредопределенноеЗначение("Перечисление.СостоянияСогласования.Согласовано"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("Сотрудники", "ФизическоеЛицо"));
	
	Возврат ОбменДаннымиЗарплатаКадрыРасширенный.ОграниченияРегистрацииПоПодразделениюИФизическимЛицам(ЭтотОбъект, Подразделение, МассивПараметров, ДатаРассмотрения);
	
КонецФункции

#КонецОбласти

#КонецЕсли
